================================================================================
Hex literal in macro
================================================================================

#define macro TEST() = takes(0) returns(0) {
    0x1234abcd
}

--------------------------------------------------------------------------------

(source_file
  (macro_definition
    name: (identifier)
    takes: (takes_clause
      (decimal_literal))
    returns: (returns_clause
      (decimal_literal))
    body: (block
      (hex_literal))))

================================================================================
Hex literal - uppercase X
================================================================================

#define macro TEST() = takes(0) returns(0) {
    0XABCD
}

--------------------------------------------------------------------------------

(source_file
  (macro_definition
    name: (identifier)
    takes: (takes_clause
      (decimal_literal))
    returns: (returns_clause
      (decimal_literal))
    body: (block
      (hex_literal))))

================================================================================
Hex literal - 32 bytes
================================================================================

#define macro TEST() = takes(0) returns(0) {
    0xffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff
}

--------------------------------------------------------------------------------

(source_file
  (macro_definition
    name: (identifier)
    takes: (takes_clause
      (decimal_literal))
    returns: (returns_clause
      (decimal_literal))
    body: (block
      (hex_literal))))

================================================================================
Decimal literal in constant
================================================================================

#define constant VALUE = 42

--------------------------------------------------------------------------------

(source_file
  (constant_definition
    name: (identifier)
    value: (decimal_literal)))

================================================================================
Decimal literal - zero
================================================================================

#define constant ZERO = 0

--------------------------------------------------------------------------------

(source_file
  (constant_definition
    name: (identifier)
    value: (decimal_literal)))

================================================================================
Decimal literal - large number
================================================================================

#define constant MAX_UINT = 115792089237316195423570985008687907853269984665640564039457584007913129639935

--------------------------------------------------------------------------------

(source_file
  (constant_definition
    name: (identifier)
    value: (decimal_literal)))

================================================================================
Hex literal in constant
================================================================================

#define constant OWNER = 0xDEADBEEF

--------------------------------------------------------------------------------

(source_file
  (constant_definition
    name: (identifier)
    value: (hex_literal)))

================================================================================
String literal in include
================================================================================

#include "path/to/file.huff"

--------------------------------------------------------------------------------

(source_file
  (include_directive
    path: (string_literal)))

================================================================================
Multiple literals in macro
================================================================================

#define macro TEST() = takes(0) returns(0) {
    0x00
    42
    0xDEAD
}

--------------------------------------------------------------------------------

(source_file
  (macro_definition
    name: (identifier)
    takes: (takes_clause
      (decimal_literal))
    returns: (returns_clause
      (decimal_literal))
    body: (block
      (hex_literal)
      (decimal_literal)
      (hex_literal))))
