================================================================================
Hex literal - lowercase
================================================================================

0x1234abcd

--------------------------------------------------------------------------------

(source_file
  (hex_literal))

================================================================================
Hex literal - uppercase
================================================================================

0X1234ABCD

--------------------------------------------------------------------------------

(source_file
  (hex_literal))

================================================================================
Hex literal - mixed case
================================================================================

0xDeAdBeEf

--------------------------------------------------------------------------------

(source_file
  (hex_literal))

================================================================================
Hex literal - single digit
================================================================================

0x0

--------------------------------------------------------------------------------

(source_file
  (hex_literal))

================================================================================
Hex literal - 32 bytes (full word)
================================================================================

0xffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff

--------------------------------------------------------------------------------

(source_file
  (hex_literal))

================================================================================
Decimal literal - zero
================================================================================

0

--------------------------------------------------------------------------------

(source_file
  (decimal_literal))

================================================================================
Decimal literal - single digit
================================================================================

7

--------------------------------------------------------------------------------

(source_file
  (decimal_literal))

================================================================================
Decimal literal - large number
================================================================================

115792089237316195423570985008687907853269984665640564039457584007913129639935

--------------------------------------------------------------------------------

(source_file
  (decimal_literal))

================================================================================
String literal - double quotes
================================================================================

"hello world"

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
String literal - single quotes
================================================================================

'hello world'

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
String literal - empty double quotes
================================================================================

""

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
String literal - empty single quotes
================================================================================

''

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
String literal - with special characters
================================================================================

"hello\nworld"

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
Multiple literals
================================================================================

0x1234
42
"test"

--------------------------------------------------------------------------------

(source_file
  (hex_literal)
  (decimal_literal)
  (string_literal))

================================================================================
Literals with comments
================================================================================

// A hex value
0xDEAD
/* A number */
42

--------------------------------------------------------------------------------

(source_file
  (comment
    (line_comment))
  (hex_literal)
  (comment
    (block_comment))
  (decimal_literal))
